Autodesk.Revit.DB.SolidCurveIntersectionMode
Represents the types of results available for calculating the intersection between a solid and a curve.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersectionMode.CurveSegmentsOutside
The results will include only curve segments outside the solid volume.

Autodesk.Revit.DB.SolidCurveIntersectionMode.CurveSegmentsInside
The results will include only curve segments inside the solid volume.   This also will include curve segments coincident
with the face(s) of the volume.